The  ISaveSharedCoordinatesCallback  type exposes the following members.
 Methods
Name  |   Description
GetSaveModifiedLinksOption
 Determines whether Revit should save the link, not save the link, or discard shared positioning entirely.
 See Also
  ISaveSharedCoordinatesCallback Interface
  Autodesk.Revit.DB Namespace